app/views/user/_add_stock.html.erb

SELECT "stock_listings".* FROM "stock_listings"
---
<%= form_for(@stock, :url => user_id_url) do |f| %>
	<%= f.select :name, StockListing.all.collect {|stock| [stock.name, stock.symbol] }, :class => "dropdown-menu" %>