app/views/user/add_stock.html.erb

<%= form_for(@stock, :url => add_stock_url) do |f| %>
	<%= f.select :name, StockListing.all.collect {|stock| [stock.name, stock.symbol] }, :class => "dropdown-menu" %>
---
SELECT "stock_listings".* FROM "stock_listings"