app/views/user/show.html.erb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = 11
---
<tr><th>Stock Name</th><th>Current Price</th><th>Bought Price</th><th># of Shares</th><th>ROI</th></tr>
<% @user.stocks.each do |stock| %>