app/controllers/stock_controller.rb

  def add
    @stock = Stock.create(:name => "Oracle", :symbol => "ORCL", :price => "30.00")
---
INSERT INTO "stocks" ("created_at", "name", "past_prices", "price", "symbol", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 05 Jul 2012 22:49:18 UTC +00:00], ["name", "Oracle"], ["past_prices", nil], ["price", "30.00"], ["symbol", "ORCL"], ["updated_at", Thu, 05 Jul 2012 22:49:18 UTC +00:00]]

  def create
    @user = User.find(params[:id])
    @stock = @user.stocks.build(params[:stock])
    if @stock.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "stocks" ("created_at", "high", "low", "name", "past_prices", "price", "symbol", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)