app/controllers/user_controller.rb

UPDATE "users" SET "remember_token" = 675853, "updated_at" = '2012-07-08 19:27:54.486687', "password_digest" = '$2a$10$pzj70Epu5ji169wBFm1VK.gQKHCezIDU2Jvp2S.Z5DYxe0sznNAK2' WHERE "users"."id" = 6
---
  def update
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def showall
    @user = User.paginate(:page => params[:page], :per_page => 4)